[
    "Judge Says Florida Man Can Grow His Own Medical Marijuana",
    "Florida Man arrested for leaving loaded gun in a public bathroom",
    "Florida Woman Drops Acid Before Babysitting, Steals Toys",
    "Mr. Florida Man, Marjory Stoneman's dumbest teacher, arrested after leaving gun unattended in public restroom",
    "Florida Man accuses son of officer he used to train with of being a 'crisis actor'",
    "Florida Man shoots himself in motorcycle crash",
    "Florida woman offers her 2003 Honda Accord for NECCO Wafers",
    "Florida woman over-enthusiastic in teaching her sex-education class, takes show-and-tell a little too far.",
    "Florida Man's car struck by lightening on his way to work, said his car saved his life.",
    "Florida Woman tries to trade car for entire stock of Necco Wafers",
    "Florida man rides for a mile on hood of (stolen) car while trying to prevent his daughter's three teenage friends from driving away from his house",
    "Florida Man Who Hit Biker In Viral Video Arrested (Video)",
    "Florida woman says cocaine must have wings because it flew through her window.",
    "14-Year-Old Florida Man Pays $480 To 28-Year-Old Scottish Woman For Sex, She Was Arrested",
    "Florida Man Steals ATV during Test Drive, Hides from Cops in Pond",
    "Florida man needs a prom date! Chick-fil-A restaurant sign lands teen date",
    "Florida man firefighter found passed out at intersection, hides cocaine in deputy's cruiser, tries to escape from hospital, gets tased",
    "Florida man punches 3 kids during fight on field, police say",
    "Police arrest Florida man who they called man bun creeper’ accused of peeking under skirts at Publix",
    "11 hurt when Florida Man uses firecrackers as distraction at Florida Mall to rob jewelry",
    "Florida Woman Gives Topless Blowjob in Public Parking Lot",
    "Florida man says 'everyone does cocaine,' but says his mom is his 'happy pill.'",
    "Florida Man tries to steal truck from county jail parking lot while in possession of drug paraphernalia and drugs.",
    "Florida man claims baseball team's citizenship is in the British Virgin Islands",
    "Florida Man lobs racial slurs, threatens another with gun in 'fishing rage' incident",
    "Florida woman 'spreads urine' 'all over' police cruiser after arrest, police say",
    "Florida Woman arrested for smoking crack while giving birth and for hiding the newborn in the backyard.",
    "Florida man arrested after being caught masturbating to sunbathers in car",
    "Florida man gets rammed off of the road after driver throws change at him",
    "Florida man, who has a gun because he is a police officer, accidentally shoots himself prompting investigation",
    "Florida woman, 26, tells police cocaine they found in her bag must have 'flown in through the window'",
    "Florida man gets distracted by his cellphone, causes mayhem",
    "Florida woman says the wind delivered cocaine to her purse",
    "Florida man forgot gun in son's bag, goes to school to get it",
    "Florida woman caught with cocaine in purse blames the wind",
    "Florida woman attempts to administer first aid to gunshot victim, beaten by angry mob who assumed she was strangling the wounded Florida man",
    "Florida Man goes full 'Florida Man'",
    "Thousands lose power after Florida Man steals Spectrum truck to drive to Denny’s",
    "Florida woman 23 killed by lightning at mud bog site",
    "Florida man has his rights taken away for trolling on reddit",
    "Florida man rings doorbell, punches homeowner for no reason",
    "Florida Man caught with drugs claims they were vitamins. They were not vitamins.",
    "Florida Man dies from Eating 7 grams of cocaine at traffic stop",
    "Florida man dies after eating 7 grams of cocaine during traffic stop",
    "A Florida Man wearing brass knuckles knocked on a door looking for someone, then slugged the man who answered the door. Turns out it was the wrong house.",
    "Florida man upset by spit, stabs man in road rage attack",
    "Florida man crashes into home, claims to be FBI agent and threatens to shoot an officer",
    "Florida man found after 40 years on the missing persons list. He changed his name after going AWOL from the Air Force and started a construction business.",
    "Florida man accused in fatal road rage stabbing hit victim with flip-flop first",
    "Grown-up Florida man lawyer disbarred for throwing paper, kicking tables and talking about boogers",
    "Florida man school superintendent pulled over for passing school bus during bus safety campaign",
    "Florida man survives snowstorm in North Dakota's Badlands by duct taping his feet, eating snow",
    "Florida Man sets fire station on fire",
    "Dead gator causing ‘unbearable stench’ in Florida woman’s backyard",
    "Just Florida man unloading his Mustang from a trailer",
    "Classic \"Florida Man\" who owes $500,000 in child support vanishes into the ocean on a paddle board.",
    "Florida man on ATV does donuts in front of deputies, taunts ‘come and get me!’ They do.",
    "Florida man grants beach property owners to a free private beach.",
    "Florida Woman outraged over video of toddler terrified of Easter Bunny goes viral",
    "Florida Man Uses Chick-Fil-A Sign To Request A Prom Date.",
    "Florida man tries to kidnap 76-year-old woman from Hobby Lobby parking lot -- and fails",
    "Florida woman claims dentist gave her a foot massage and infection",
    "Florida woman mistakes 37-week pregnancy for bad Chinese food",
    "Florida man tells cops his heroin was 'daily vitamins'",
    "Florida Man superintendent pulled over for passing school bus during bus safety campaign",
    "Florida man passes himself as decorated war veteran to land job",
    "Florida man's car spat on by passenger of landscaping truck, and then got out of his car and stabbed the man to death",
    "Florida man reunites with cat lost 14 years ago to hurricane",
    "Florida woman substitute teacher unbuttoned pants, danced to rap, said she smokes pot to students who turned her in",
    "Florida woman welcomes motorists by flashing her breasts, crotch.",
    "Pregnant Florida Woman corrections officer pepper sprays husband because she has 'insecurity issues'",
    "Florida Woman sets ex-boyfriend on fire during Easter dinner",
    "Florida woman stole more than $1,700 in goods from Toys 'R' Us, deputies say",
    "Florida Man dies after swallowing cocaine at traffic stop",
    "Florida man bites chicken's head off, charged with animal cruelty, police say",
    "Florida Man bites head off chicken.",
    "Florida Man and Disney bus driver arrested in undercover child-sex sting",
    "Florida Man Assaults Gas Station Cashier for Trying to Stop Him From Cutting Line",
    "Florida Man breaks into house, eats salad, masturbates, plays with toy helicopter",
    "Florida Man nakedly attacks neighbor with garden shears, then tries to drown the cops while being arrested",
    "Florida man set on fire by ex gf during Easter dinner",
    "Florida Woman Gets OK To Keep Rambo, Her Clothes-Wearing, ATV riding Gator",
    "Florida Woman Fights to Keep Her Pet Alligator Who Wears Clothes and Rides ATVs",
    "A man from Florida man...(picture in comments)",
    "Florida Woman resigns as a school teacher after it is discovered she runs a white supremacist podcast.",
    "Florida man pulled over after stealing dog treats",
    "Florida woman (U.S. representative's wife) arrested on disorderly intoxication charge",
    "Florida Man Removes 11 ft Alligator from Swimming Pool",
    "Florida man steals boat, gets stuck on sandbar and rescued by deputies",
    "Florida Man believes giant snake is Godzilla!",
    "Vanishing Florida Man",
    "Florida Man politely asks 911 dispatchers to find Drake and Lil Wayne",
    "Florida Man Faces Charges After Being Bitten Attempting to Kiss Venomous Snake",
    "Florida Man's mugshots tell a story of their own",
    "Florida man dresses up as giant rat and patrols college campus",
    "Florida Man who owes $500K in child support vanishes into ocean on paddleboard | abc7.com",
    "Florida Woman opens restaurant that only serves foods starting with the letter C",
    "Drunk Florida man 'yells come and get me' to deputies, is arrested",
    "Florida Man mistakenly told he has death sentence after jury botches form",
    "Florida woman mistakes 37-week pregnancy for bad Chinese food",
    "Florida man ties drugs to his junk. Cops say it's a ballsy move.",
    "Florida woman gives birth hours after learning she's pregnant",
    "Florida man drops off bathtub, ice, TV cable at closed restaurant called Helen Back",
    "Florida man shot at roofers after one looked at woman, police say",
    "Florida woman arrested after giving birth to brother’s baby, deputies say",
    "Florida woman mistakes 37-week pregnancy for bad Chinese food",
    "Florida Man claims coconut hit windshield. Cops say he was drunk, ran over art auctioneer.",
    "Drunk Coast Guard Florida Man swims in strangers pool, forgets wallet, socks and shoes.",
    "Florida Woman Arrested After Giving Birth To Her Brother's Baby",
    "Florida Man YouTube star claimed to be 'very powerful,' threatened lawsuit during Disney arrest",
    "Florida Man caught on tape snatching wild peacock, running down street with it",
    "Family of Florida man killed by police said officers used dead man's finger to gain access to phone",
    "Florida man who owed $500K in child support disappears into the sunset on a paddleboard",
    "Florida Man steals more than $7,000 from his granny's bank account, florida granny pressing charges",
    "Florida man uses LSD, breaks into stranger's home to shower",
    "Florida Man harassed woman, fired shotgun at her and hid under bed while SWAT arrived",
    "Florida Man arrested after driving drunk on scooter with dog in shopping bag",
    "Florida man who owes over $500G in child support vanishes in ocean the day he’s due in court, police say",
    "“COME AND GET ME!” FLORIDA MAN ARRESTED AFTER DOING DONUTS IN FRONT OF DEPUTY WITH BEER IN HAND",
    "Florida man arrested after slow-speed police chase for stolen license plate, found illegal gun ammo + clips in car",
    "Florida man tries stealing money from the church drop box... he probably said “oops.”",
    "Florida Man in possession of drugs arrested in separate shoplifting incident",
    "Florida man wearing Budweiser shirt gets DUI on golf cart.",
    "Florida man booby traps stairs",
    "Florida Man at it again ...I’m sure all Federal Marshals have wonderful hair like his.",
    "Florida Man charged with assault with a deadly pop tart.",
    "Florida woman fails to put car in park, vehicle rolls into swimming pool with husband, child inside",
    "Florida Woman arrested for incest after child is born with several issues.",
    "Florida Man don't need assault weapons",
    "Florida Man squatter extorts a trailer owner and then burns down said trailer, all within a couple of days",
    "Florida man takes his chances, arrested shortly after.",
    "Florida Man who stole Harley from crash site didn't think owner wanted it any more",
    "Viral selfie of hot police officers lands Florida man on romance novel covers",
    "Florida Man Sued For Not Paying For 6ft-Tall Trump Paintings He Bought",
    "Florida man arrested with a dozen guns after making threats",
    "Florida Man and Florida Woman steal toys from Florida shooting memorial.",
    "Florida Woman marries 100-year-old tree in hopes of saving it from being cut down",
    "Florida man accused of stealing nearly $300 in meat from Walmart",
    "Florida Woman, who has never heard of a petition, marries tree to save it",
    "Florida Man Shoves Mom Because He Doesn't Like Ham",
    "Florida woman runs into massive rattlesnake, F-bombs fly",
    "Florida man accused of hitting wheelchair-bound father w. a grocery bag of clothes and personal hygiene items",
    "Florida Man convicted in $87 million fraud serves only 8 months in minimum security prison and as felon now collects $60K tax-free pension in Panama - Worked as U.S. Department of Justice executive for 20 years. Guess who his wife is?",
    "Florida Man who was U.S. federal agent whistleblower and author of confiscated book manuscripts reports that he and other American political prisoners were tortured in Miami solitary confinement and has scars, witnesses & doctor reports to confirm it",
    "Florida Man signs off on bill to make permanent change to Florida clocks",
    "Blocked from passing, Florida Man driver throws rock at SUV",
    "Florida Man beats friend with bat over $5",
    "Florida man pulled over, presents Lowe’s coupon as license then offers coo handjob",
    "Florida woman puts Zoo trespasser in alligator hold until police arrive",
    "Florida Man breaks into house. Takes shower.",
    "Florida Man tries tries to burn down trailer using spaghetti sauce and a wash cloth while wearing a bull onesie",
    "Florida man gets busted for impersonating a federal marshal in front of the cops",
    "Florida Man shoots self in leg to profess love for ex-girlfriend",
    "Florida Man from my office had installed video recording devices above the ceiling tiles inside two different women's restrooms.",
    "Florida man crashes through gate at federal law enforcement training center in Brunswick, GA",
    "Florida man punches pregnant woman in the face in a grocery store.",
    "Florida man reunites with pet cat that ran away 14 years ago",
    "Florida man starts fight with his girlfriend in the Walmart parking lot",
    "Florida man shoots himself in the leg to prove his devotion to his ex",
    "Florida man can't find the mystery smell in Wellington",
    "Florida Man Steals Cable Truck, Knocks Out Service For Thousands",
    "Florida Man Offers Cop a Handjob",
    "Florida man assaults gas station cashier with hot dogs after being refused beer sale",
    "WATCH: Florida man steals exotic fish, stuffs them down his pants",
    "Florida Man love story: He forgot their anniversary, so she smacked him",
    "Florida Man Arrested for DUI had BAC of .316",
    "Florida man thought he was chatting with a prostitute on Facebook. It was the cops",
    "Florida Woman leaves 4yr old at home in order to buy weed",
    "Florida woman found covered in vomit, huffed compressed air outside store",
    "Florida man instigates his own son's fight, then joins in",
    "Florida Man steals a car, realizes a baby is in it, drops baby off safely, and makes his get away.",
    "Florida Man, local musical theater star, accused of embezzling $77K from his day job. He recently starred in a local production of \"How To Succeed In Business Without Really Trying\".",
    "Florida man, one dressed in bull onesie, attempt to burn down house with Ragu sauce, police say",
    "Florida man makes homemade whiskey bomb, tries to kill another man's chickens.",
    "Florida man looked 'nervous' after blowing a stop sign. Deputies soon found out the reason",
    "Florida man busted on marijuana 'grow boat'",
    "Florida Man tells cops his name is 'Captain Dickhead,' gets arrested for obstruction",
    "Florida woman breaks into car to sleep, sets it on fire, can't unlock to escape.",
    "Intoxicated Florida man drinks milk out of roommate’s glass, resulting in eruption of pain and jail time.",
    "Florida Man Bike Shop Owner Forced Burglars He Caught in the Act to Strip Naked & \"Tortured\" Them",
    "Golf Cart-Driving Florida Man Tries to Blow Up Neighbor’s Chickens With Home-Made Whiskey Bomb During Dispute Over BB Gun",
    "Report: Florida man caught masturbating at Walmart",
    "Florida man accused of stealing car with baby inside at gas station told clerk, ‘take the baby!’",
    "Florida man exposes self and grabs woman police say.",
    "Florida man asks for death penalty because it's a 'win-win' for everyone",
    "Florida Man Sheriff's Lieutenant charged with DUI, fired after she's spotted driving backward",
    "Florida Man in Bull Onesie Attempts to Burn Ex’s House with Spaghetti Sauce",
    "Florida man accused of shoving mother over ham",
    "Suspected Florida Woman Crashes Car With Full Gas Tank Into Broward County Sheriff's Substation Lobby",
    "Florida Man Throws Beer, Kicks Cars at ShrimpFest",
    "Florida Man Steals Ambulance, Drives Home After Long ER Wait",
    "Military-grade explosives found in former officer Florida man's home",
    "Florida woman gets fired from her job as a sheriff deputy for DUI on St Patrick's day",
    "Florida man armed with 20-inch knife tries to carjack sheriff citizen patrol car",
    "Florida Man attacks wife over lack of Fried Chicken",
    "Florida man stole victim's SUV after fatal crash",
    "Florida Man & Daughter Charged With Incest After Alleged Sex in Backyard",
    "Florida Man Firefighter Falls Off Bridge Into St. John's River Rescuing Woman From Burning Car",
    "Florida woman claims being overweight should be a protected class because she can't fit on a theme park attraction",
    "Florida Man makes homemade bomb out of Canadian Mist bottle, black powder & sand, then throws it at chickens.",
    "Florida man gives wife kidney for anniversary",
    "Police: Florida woman drove drunk with child, 4 flat tires",
    "Florida Man deliberately scattering roofing nails on a portion of Florida's US 1",
    "In 1966, a Florida Man and his band shot to #2 on the Billboard charts with an unlicensed Peanuts fan song.",
    "Floridaman busted for being shady",
    "Florida woman charged with stealing up to $400,000 worth of items from storage units, including a Preakness Cup trophy",
    "No. 1 suspect? Police seek Florida woman they say urinated in driveway of home she burgled",
    "Florida woman is facing a battery charge for allegedly physically assaulting her nephew after she fell on top of a goat while intoxicated",
    "FloridaMan likes Bitcoins apparently",
    "Florida Man fights alligator.",
    "Florida man's camper hangs 'precariously' from overpass after crash",
    "Florida man who said he helped bury Natalee Holloway dies in failed kidnapping",
    "FloridaMan steals Spectrum Fiber Internet Service Truck during large area Internet outage",
    "Florida Man won Charles Manson's corpse",
    "Florida Man used spaghetti sauce to try to start fire after burglary",
    "Florida man fatally stabs friends who doubt his religion",
    "Florida Man Pistol Whipped With Dog Toy Tennis Ball Launcher",
    "Florida woman enjoys peeing in neighbor's yard",
    "Florida Man arrested for using government computers to mine bitcoin",
    "Florida Man steals cable truck, damaging pole and fiber cable, affecting service to 7,000 residents",
    "Florida Man gives wife kidney for 23rd anniversary",
    "Florida Man applies for a job, steals a forklift",
    "WATCH: Florida Man steals neighbor's peacock, gets chased by angry birds",
    "Hit-and-run suspect Florida Man who drove through sledgehammer attack ticketed 29 times in 10 years",
    "82-year old Florida Man takes wrong turn and gets sideswiped by train",
    "Florida man shoots suspect in home invasion: 'They messed with the wrong house'",
    "Florida Man Hides From West Virginia cops in Chest Freezer.",
    "FloridaMan attempts to hit and run",
    "Florida man wins custody battle for the remains of Charles Manson.",
    "Florida Woman who runs a Facebook page \"for gun sense\" is accidentally shot by her 4-year-old son while driving",
    "Florida man is in critical condition after he accidentally shot himself in the head while unloading his gun",
    "Florida Man Tries to Sell Stolen Pupper Back to Priginal Owners",
    "Florida Man",
    "Florida Man Throws Battery Acid at Girlfriend",
    "Sledgehammer wielding Florida Man prevents hit and run get away",
    "classic florida man attacked by another florida man with a hammer",
    "Florida Man Shoots Himself While Unloading Gun",
    "Florida man takes horse into Miami Beach nightclub",
    "Florida woman jailed for 5 months because of a failed field drug test. The lab test took 7 months to come back, revealing it was a vitamin. She was initially charged with trafficking oxycodone.",
    "Florida woman Rides Horse Into Crowd Of Partygoers",
    "Florida Woman in underwear rides a white horse into a crowded dance club in Miami Beach",
    "Florida Woman, obviously concerned about the moral probity of children, takes action at a Little League game by attacking a woman wearing 'short shorts'.",
    "Florida man \"Police Officer of the year\" and Florida woman arrested for child neglect after \"absolutely disgusting home\" filled with dog feces, drugs, firearms and garbage discovered after gunshots reported by neighbor.",
    "Florida man arrested after texting detective, not wife, about girlfriend’s death",
    "Bikini-clad Florida Woman gets nightclub shut down after riding to it on horseback",
    "Florida man upset over 2-hour ED wait steals ambulance to drive home",
    "Florida Man Indicted for International Email Impersonation and Fraud Scam | USAO-MA",
    "Florida man tells his class not to date African-Americans 'because they are not worth it'",
    "Florida Man Sucks Down 16 Vodkas &amp; Eats One Chimichanga Over 8 1/2 Hours, Refuses To Pay Tab",
    "Florida Man monkey importer mails white powder to himself in attempt to frame animal rights group",
    "Miami Beach revokes club’s business license after Florida Woman brought horse onto dance floor",
    "Florida Woman claims injury caused by drag queen’s breast, sues Hamburger Mary’s for $1.5 million",
    "Florida woman sues Hamburger Mary's for $1.5M, says she was injured by a drag queen's breast",
    "Florida man with hilarious hair accused of robbing nearly 20 of his neighbors' cars",
    "FloridaMan liked something on Facebook. Then he went to jail.",
    "Florida woman rides Florida horse into bar...",
    "Florida Man, Teacher Keeps Job After Telling Students Not To Date Anyone ‘Acting Like A N****r’",
    "Floridaman politicians actually make a good decision for once and vote to keep Daylight Savings Time year-round",
    "Perhaps it's because he's a Florida Man, or perhaps it's because they don't have these things called hills back home. But Florida Man goes up a hill and crashes on the other side.",
    "Florida Man steals an ambulance, complains to arresting officer about long wait times at the hospital",
    "Florida man who advertised as doctor on Instagram arrested, police say",
    "Florida Man who is a convicted felon honks horn at cops working an accident. Has numerous drugs and weapons in his car in plain sight.",
    "60,000 pounds of Florida man's beer spilled onto highway",
    "Florida Man advertises affordable plastic surgery on Instagram, even though he's not a doctor",
    "Florida Woman Viciously Attacked by Possibly Rabid River Otter",
    "Angry Florida woman upset over order throws hot pizza at manager",
    "Florida man accused of stealing ambulance",
    "Florida man likes kids, but not in a good way.",
    "Florida man waits for his Lamborghini with an armful of stolen M&M's and Swisher Sweet cigars.",
    "Florida woman wins conch-blowing contest; accepts proposal",
    "Florida man takes credit for “Tar and Feather Enemy of Freedom Award” given to lawmakers",
    "Florida Woman isn't racist, she pinky swears!",
    "Florida man plants oak tree upside down",
    "Florida Man gets 20 years for $66 million Medicaid fraud used to buy 19 healthcare agencies and a meat supermarket",
    "Florida man has headache. Finds out wife shot him in his head while he slept (2007).",
    "Florida Man and HS Baseball Coach arrested with meth, said it belonged to a player.",
    "Florida Woman attacked by wild otter. “It didn’t want to come off.”",
    "Florida man allegedly pulls AR-15 in road rage incident",
    "Machete-wielding Florida man jailed for hindering Jacksonville fire crews",
    "Drunk Florida woman crashes car in Publix parking lot, buys more wine",
    "FloridaWoman state senator: Only \"thoughts and prayers\" will stop mass shootings",
    "10-Year-Old Florida Man on Probation for Car Theft Caught Stealing Another Car",
    "Florida man caught having sex in backyard with daughter",
    "16 vodka drinks + 1 chimichanga = bad news for Florida man",
    "Woman thwarts carjacking attempt, leaves Florida Man dangling out car window",
    "Florida Man Hall of Fame Sailor Rescued After Capsizing Boat",
    "Former NASCAR Driving Florida Man Arrested For Trying to Have Sex With Child",
    "Florida Woman crashes car in Publix parking lot, buy more wine.",
    "Florida Woman Yoga Teacher Attempted to Smuggle Drugs Into Miami-Dade Prison: Police",
    "Florida man paralyzed after chasing monkey that stole his hat",
    "Florida Woman wins Conch Blowing contest and gets engaged all in the same day",
    "Florida man and daughter caught having sex in their backyard",
    "Florida Man, daughter caught having sex in their backyard.",
    "Naked Florida Woman Shoots FloridaMan",
    "Florida Man Calls 911 To Report Missing Cocaine",
    "Florida woman (a teacher) hosts white nationalist podcast.",
    "Florida man arrested for reportedly tossing gator into Wendy's"
]